In [1]:
import pandas as pd
import pyarrow as pa
import pyarrow.parquet as pq

In [2]:
ls

data_structure.ipynb*

In [3]:
df = pd.read_csv('../dataset/washington/trips.csv', nrows=1000)

In [4]:
df.head()

,start_date,start_station_code,end_date,end_station_code,duration_sec,is_member,yearid
0,2010-09-20 11:27:04,0,2010-09-20 11:43:56,27,1012.0,1,2010
1,2010-09-20 19:28:17,0,2010-09-20 19:36:25,27,488.0,1,2010
2,2010-09-21 08:13:04,0,2010-09-21 08:19:13,27,369.0,1,2010
3,2010-09-21 17:10:14,0,2010-09-21 17:32:55,27,1361.0,0,2010
4,2010-09-23 20:33:16,0,2010-09-23 20:50:07,27,1011.0,0,2010

In [5]:
print(pd.io.sql.get_schema(df, 'BikeSharing'))

CREATE TABLE "BikeSharing" (
"start_date" TEXT,
  "start_station_code" INTEGER,
  "end_date" TEXT,
  "end_station_code" INTEGER,
  "duration_sec" REAL,
  "is_member" INTEGER,
  "yearid" INTEGER
)

In [6]:
df.start_date = pd.to_datetime(df.start_date)
df.end_date = pd.to_datetime(df.end_date)

In [7]:
print(pd.io.sql.get_schema(df, 'BikeSharing'))

CREATE TABLE "BikeSharing" (
"start_date" TIMESTAMP,
  "start_station_code" INTEGER,
  "end_date" TIMESTAMP,
  "end_station_code" INTEGER,
  "duration_sec" REAL,
  "is_member" INTEGER,
  "yearid" INTEGER
)

In [8]:
df_stations = pd.read_csv('../dataset/washington/stations.csv', nrows=1000)
df_stations.head()

   code                           name  latitude  longitude  yearid
0     0       M St & New Jersey Ave SE       NaN        NaN    2010
1     1                 1st & N St  SE       NaN        NaN    2010
2     2                  5th & K St NW       NaN        NaN    2010
3     3  19th St & Pennsylvania Ave NW       NaN        NaN    2010
4     4                  7th & T St NW       NaN        NaN    2010

In [9]:
print(pd.io.sql.get_schema(df_stations, 'Station'))

CREATE TABLE "Station" (
"code" INTEGER,
  "name" TEXT,
  "latitude" REAL,
  "longitude" REAL,
  "yearid" INTEGER
)

In [10]:
df_weather = pd.read_csv('../dataset/washington/weather.csv', nrows=1000)
df_weather.head()

,date,prectot,qv2m,rh2m,ps,t2m_range,ts,t2mdew,t2mwet,t2m_max,t2m_min,t2m,ws50m_range,ws10m_range,ws50m_min,ws10m_min,ws50m_max,ws10m_max,ws50m,ws10m
0,2010-10-20,3.31,7.80,95.17,100.22,5.75,10.81,10.26,10.26,13.95,8.20,11.00,4.48,1.68,0.94,0.87,5.43,2.56,2.87,1.61
1,2010-10-21,0.22,5.99,72.13,99.76,11.73,11.03,6.22,6.22,18.45,6.72,11.14,2.93,2.64,4.94,2.62,7.87,5.27,6.31,3.67
2,2010-10-22,0.02,4.47,62.97,100.92,9.06,8.46,2.29,2.32,14.01,4.95,9.00,4.71,3.54,2.70,1.85,7.42,5.39,5.61,3.42
3,2010-10-23,0.00,5.80,70.08,101.27,17.58,11.08,5.67,5.68,20.59,3.01,11.32,4.64,1.46,2.59,2.07,7.23,3.53,5.07,2.85
4,2010-10-24,0.00,7.91,76.84,100.92,13.73,14.40,10.52,10.52,22.87,9.14,14.59,3.84,0.75,3.27,2.33,7.10,3.08,5.05,2.67

In [11]:
print(pd.io.sql.get_schema(df_weather, 'Weather'))

CREATE TABLE "Weather" (
"date" TEXT,
  "prectot" REAL,
  "qv2m" REAL,
  "rh2m" REAL,
  "ps" REAL,
  "t2m_range" REAL,
  "ts" REAL,
  "t2mdew" REAL,
  "t2mwet" REAL,
  "t2m_max" REAL,
  "t2m_min" REAL,
  "t2m" REAL,
  "ws50m_range" REAL,
  "ws10m_range" REAL,
  "ws50m_min" REAL,
  "ws10m_min" REAL,
  "ws50m_max" REAL,
  "ws10m_max" REAL,
  "ws50m" REAL,
  "ws10m" REAL
)

In [12]:
df_weather.date = pd.to_datetime(df_weather.date)
print(pd.io.sql.get_schema(df_weather, 'Weather'))

CREATE TABLE "Weather" (
"date" TIMESTAMP,
  "prectot" REAL,
  "qv2m" REAL,
  "rh2m" REAL,
  "ps" REAL,
  "t2m_range" REAL,
  "ts" REAL,
  "t2mdew" REAL,
  "t2mwet" REAL,
  "t2m_max" REAL,
  "t2m_min" REAL,
  "t2m" REAL,
  "ws50m_range" REAL,
  "ws10m_range" REAL,
  "ws50m_min" REAL,
  "ws10m_min" REAL,
  "ws50m_max" REAL,
  "ws10m_max" REAL,
  "ws50m" REAL,
  "ws10m" REAL
)

In [36]:
weather_table = pa.Table.from_pandas(df_weather)
pq.write_table(weather_table, 'weather.parquet')

In [37]:
stations_table = pa.Table.from_pandas(df_stations)
pq.write_table(stations_table, 'stations.parquet')

In [38]:
trips_table = pa.Table.from_pandas(df)
pq.write_table(trips_table, 'bike_sharing.parquet')